In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [26]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [27]:
print(type(s))

<class 'pandas.core.series.Series'>

In [4]:
data = { 'apples': [3, 2, 0, 1], 'oranges': [0, 3, 7, 2] }

In [5]:
fruit = pd.DataFrame(data) 
fruit

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [28]:
print(type(fruit))

<class 'pandas.core.frame.DataFrame'>

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [32]:
df-test = pd.DataFrame(np.random.randn(6,4),columns=list('ABCD'))
df-test

SyntaxError: can't assign to operator (<ipython-input-32-87840e783c7f>, line 1)

In [31]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.505387  0.821819  0.149810 -0.939286
2013-01-02 -0.264836 -0.483991  0.324518 -0.262000
2013-01-03  2.495105  0.202643  0.957138  0.171867
2013-01-04  0.417798  1.351702  0.506862  1.266616
2013-01-05  0.077262  0.409632  1.880088 -2.894787
2013-01-06  0.979578  0.127933  0.337029 -0.577071

In [9]:
# Creating a DataFrame by passing a dict of objects that can be converted to series-like.
df2 = pd.DataFrame( {'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'}  )
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
fruit = pd.DataFrame(data, index=['First', 'Second', 'Third', 'Fourth'])
fruit

        apples  oranges
First        3        0
Second       2        3
Third        0        7
Fourth       1        2

In [11]:
df = pd.read_csv('fruit.csv') 
df

   apples oranges
0           0 3 0
1           1 2 3
2           2 0 7
3           3 1 2

In [12]:
df.head(3)

   apples oranges
0           0 3 0
1           1 2 3
2           2 0 7

In [13]:
df.tail(2)

   apples oranges
2           2 0 7
3           3 1 2

In [14]:
fruit = pd.DataFrame(data, index=['First', 'Second', 'Third', 'Fourth'])
#df = pd.read_csv('fruit.csv',index_col=0) 
#df
fruit

        apples  oranges
First        3        0
Second       2        3
Third        0        7
Fourth       1        2

In [15]:
#fruit1=pd.Dataframe(fruit,index_col=0)
#fruit1=pd.Dataframe(fruit)
fruit1 = pd.DataFrame(fruit)
fruit1

        apples  oranges
First        3        0
Second       2        3
Third        0        7
Fourth       1        2

In [16]:
df3 = pd.read_csv('fruit2.csv',index_col=0) 
df3

Empty DataFrame
Columns: []
Index: [first 3 0, second 2 3, Third 0 7, Fourth 1 2]

In [33]:
df3.shape

(4, 0)

In [17]:
df3.axes

[Index(['first 3 0', 'second 2 3', 'Third 0 7', 'Fourth 1 2'], dtype='object', name=' apples oranges'),
 Index([], dtype='object')]

In [34]:
df3.values

array([], shape=(4, 0), dtype=float64)

In [18]:
print(type(df3))
print(type(df3.values))

<class 'pandas.core.frame.DataFrame'>
<class 'numpy.ndarray'>

In [19]:
print("Df3 shape",df3.shape)
print("Df3 size",df3.size)
print("Df3 type",df3.dtypes)
print("Df3 no of dimensional",df3.ndim)
print("Df3 columns",df3.columns)

Df3 shape (4, 0)
Df3 size 0
Df3 type Series([], dtype: object)
Df3 no of dimensional 2
Df3 columns Index([], dtype='object')

In [20]:
print(df)
df.sum(1)

   apples oranges
0           0 3 0
1           1 2 3
2           2 0 7
3           3 1 2

0    0 3 0
1    1 2 3
2    2 0 7
3    3 1 2
dtype: object

In [21]:
df.describe()

        apples oranges
count                4
unique               4
top              1 2 3
freq                 1

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0    apples oranges  4 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

In [23]:
df.sum()

 apples oranges    0 3 01 2 32 0 73 1 2
dtype: object

Sorting Examples

In [24]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1')
print(unsorted_df)
print(sorted_df)

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4
   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

Selection

In [25]:
unsorted_df['col1']

0    2
1    1
2    1
3    1
Name: col1, dtype: int64